[
  {
    "Original_Tweet": "@mustafatawfiq_ @zerohedge Yes, there's a real chance of domino effects from the tariff-driven market drop. The S&P 500's 10% weekly plunge, heavy selling, and shorting signal volatility ahead. Margin calls could worsen it, though solid US fundamentals might cushion the blow. Trade war fears add",
    "Summary": "Domino effects from tariff-driven market drops could trigger volatility and margin calls amid escalating trade war fears.",
    "Sentiment": -0.7783,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "@Colewherld THE DOW'S MELTDOWN: GLOBAL MARKETS SILENT UNDER A DARK CLOUD OF UNCERTAINTY \nhttps://t.co/sPUAy96rX4",
    "Summary": "Global markets face uncertainty as the Dow experiences a meltdown under a dark cloud of apprehension.",
    "Sentiment": -0.4824,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "@culpable_mink Trump tariff is not \"blanket tariff\", it has exceptions and exemptions, for example semiconductors, pharmaceuticals, etc.\n\nMore important is the intent, tariff's intent to bring more manufacturing to the US, which is good; left's intent is becoming more radical, which is bad.",
    "Summary": "Trump’s selective tariff—with exceptions on semiconductors and pharmaceuticals—is designed to boost US manufacturing and counter a radical left agenda.",
    "Sentiment": 0.1263,
    "Cluster": 2,
    "Theme": "trump, tariffs, tariff"
  },
  {
    "Original_Tweet": "3y ago, the US froze Russian assets, asserting its sovereignty and retaliatory power.\nToday, as Trump tariffs wreak havoc and fuel uncertainty, foreigners contemplating expropriation risk to their US assets won’t bother fine-tuning risk premiums—they’ll just offload them instead.",
    "Summary": "Foreign investors are offloading US assets amid tariff-induced uncertainty, echoing past measures like asset freezes to assert sovereignty.",
    "Sentiment": -0.8591,
    "Cluster": 3,
    "Theme": "trade, china, trump"
  },
  {
    "Original_Tweet": "@Bubblebathgirl It’s called a trade war cunt and every economist agrees it’s a dumbfuk idea that will cause a recession and make the country weaker and poorer. Only the crowd with IQ’s around 75 think his tariff theory (which he got from a fake economist btw) will usher in a golden age",
    "Summary": "Critics dismiss the trade war as a foolish, recession-triggering policy that will weaken the nation, contrary to the views of its low-IQ supporters.",
    "Sentiment": -0.8885,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "Singapore PM’s Chilling Warning To World Amid Chaotic Trump Tariffs: ‘Tr... https://t.co/qyIGbwxrxI via @YouTube",
    "Summary": "Singapore's PM warns that chaotic Trump tariffs could have chilling and far-reaching global repercussions.",
    "Sentiment": -0.6908,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "Communication between Washington and Beijing is at a standstill, raising the prospects of a long cycle of tariff retaliation. “Trump and Xi are locked in a paradox of pressure and pride.” https://t.co/Imi6R0HZWy via @WSJ",
    "Summary": "Stalled talks between Washington and Beijing leave Trump and Xi locked in a paradox of pressure and pride, hinting at prolonged retaliation.",
    "Sentiment": -0.1027,
    "Cluster": 3,
    "Theme": "trade, china, trump"
  },
  {
    "Original_Tweet": "@mattgaetz Switzerland has no tariffs on American goods. Trump decided to hit them with either a 31% or 32% tariff (no one knows which), because Trump Tariffs are “beautiful” ~",
    "Summary": "Despite Switzerland's lack of tariffs on American goods, Trump’s policy targets them, sparking debates over fairness.",
    "Sentiment": -0.296,
    "Cluster": 0,
    "Theme": "switzerland, tariffs, american"
  },
  {
    "Original_Tweet": "Navigating The Tariff Fallout: Asset Allocation In A Trade War. https://t.co/r8IdXTJ1O3 #stockmarket #economy #markets",
    "Summary": "Investors adjust their asset allocations as they navigate the economic fallout from an ongoing trade war.",
    "Sentiment": -0.34,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "'@nbcsnl' Mocks Trump Tariff Plan and #MikeMyers Returns as @elonmusk  https://t.co/RZwOV13Btp",
    "Summary": "A satirical take mocks Trump’s tariff plan, with Mike Myers’ return adding to the surreal commentary.",
    "Sentiment": -0.4588,
    "Cluster": 2,
    "Theme": "trump, tariffs, tariff"
  },
  {
    "Original_Tweet": "@LauraPowellEsq \"Trump's Tariffs: A Tariff Hike That Would Leave You Feeling Thrifty!\" 💸💰 \nhttps://t.co/RQtf3IOMlF",
    "Summary": "A provocative headline suggests Trump's tariffs might force consumers to cut back, hinting at unexpected economic strain.",
    "Sentiment": 0.1511,
    "Cluster": 2,
    "Theme": "trump, tariffs, tariff"
  },
  {
    "Original_Tweet": "@CNN @FoxNews @realDonaldTrump #Trump screwed Pandemic BUT at least that was unknown territory. NOW the rest, Tariffs, Canada as State, belittling people, lies, telling the world to screw off, abuse of power. Someone MIST STOP THIS! https://t.co/bpjvMyjBvC",
    "Summary": "Amid a mishandled pandemic, Trump’s subsequent tariffs and controversial policies continue to stir outrage and confusion.",
    "Sentiment": -0.9545,
    "Cluster": 3,
    "Theme": "trade, china, trump"
  },
  {
    "Original_Tweet": "Trump voters got exactly what they wanted — so why are people complaining? https://t.co/RC0HKhZ0JQ",
    "Summary": "Trump supporters claim they received exactly what they desired, though critics remain unconvinced.",
    "Sentiment": -0.2023,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "@SpencerHakimian Chinas economic leash isn't as long as we Westerners have been scared into thinking it is.\n\nThere are plenty of world economists (including Chinese) that know there is a major crash coming to China as well.\n\nAmerica can, and will, survive a current trade war with China.",
    "Summary": "Experts warn that despite fears, China's economic grip may be overestimated, and the US could weather the ongoing trade war.",
    "Sentiment": -0.8268,
    "Cluster": 3,
    "Theme": "trade, china, trump"
  },
  {
    "Original_Tweet": "Live Updates: Stock Rout Intensifies as China Retaliates for Trump Tariffs\nThis is a volatile situation indeed. It's fascinating to see how trade wars play out across global markets, creating ripples that impact economies large and small 😊! 🌎💰  \nhttps://t.co/EHvvl2xuaf",
    "Summary": "China's retaliation against Trump tariffs intensifies a stock rout, highlighting deep market volatility.",
    "Sentiment": 0.8687,
    "Cluster": 3,
    "Theme": "trade, china, trump"
  },
  {
    "Original_Tweet": "America likes to declare war on an idea (drugs, terror, Covid etc) spend trillions of dollars for decades, destroy peoples lives in every way imagined, and eventually lose. Enjoy the Trade War everybody! 🥳",
    "Summary": "America's long history of waging wars on ideas is criticized as a self-defeating strategy, with the trade war being the latest example of its costly failures.",
    "Sentiment": -0.8777,
    "Cluster": 3,
    "Theme": "trade, china, trump"
  },
  {
    "Original_Tweet": "'Welp, There Goes the Economy': Trump Tariffs Trigger Global Alarm https://t.co/iVcrylmJeq",
    "Summary": "Trump tariffs have triggered a global alarm, with warnings that the economic fallout could be catastrophic.",
    "Sentiment": -0.34,
    "Cluster": 2,
    "Theme": "trump, tariffs, tariff"
  },
  {
    "Original_Tweet": "'Batsh*t Crazy' Trump Tariffs Should Be Seen as $7,000 Tax Hike on Workers, Says Economist\nInstead of strategically imposing tariffs, Trump has chosen to \"give the country the most massive tax increase in its history, possibly exceeding $1 trillion on an annual basis.\"",
    "Summary": "An economist argues that Trump's tariffs effectively act as a $7,000 tax hike on workers, potentially costing the country trillions annually.",
    "Sentiment": -0.0609,
    "Cluster": 2,
    "Theme": "trump, tariffs, tariff"
  },
  {
    "Original_Tweet": "@stevesaldivar @LeaKThompson The latest poll about Trump says you’re STILL in the minority https://t.co/TSqi43THJP",
    "Summary": "Recent polls indicate that Trump remains a minority choice among voters, despite persistent support from his base.",
    "Sentiment": 0.0,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "Not even 24 hours after his party lost a key Wisconsin race and underperformed in Florida, President Donald Trump followed the playbook that has defined his political career: He doubled down.\nhttps://t.co/0XaOlHrcFX",
    "Summary": "Following a major electoral setback, Trump doubled down on his strategy, reinforcing his established political playbook.",
    "Sentiment": 0.1027,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "\"Trump tariffs led to a $2.5 trillion US stock market wipeout – and worse is yet to come\" - The Independent #SmartNews  https://t.co/vrYLeRFiDX",
    "Summary": "A headline warns that Trump's tariffs triggered a $2.5 trillion market wipeout, with further economic damage looming.",
    "Sentiment": -0.4767,
    "Cluster": 2,
    "Theme": "trump, tariffs, tariff"
  },
  {
    "Original_Tweet": "Ted Cruz, the US senator from Texas, has warned that his fellow Republicans risk a 'bloodbath' in the 2026 midterm elections if Donald Trump’s 'liberation day' tariffs cause a recession.\nhttps://t.co/KpoQu5XeVu",
    "Summary": "Senator Ted Cruz warns that Trump's tariffs could trigger a recession, leading to a 'bloodbath' in the 2026 midterms.",
    "Sentiment": -0.7184,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "@DukeMBB Duke 0-1 since Trump Tariffs went into effect. We in a recession but at least there’s a silver lining.",
    "Summary": "As Trump tariffs take effect, Duke's record falters—a metaphor for a broader recession with a narrow silver lining.",
    "Sentiment": -0.2263,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "Trump has been 'worse than Covid' after only 75 days: ex-GOP lawmaker https://t.co/od7up3B1FK",
    "Summary": "An ex-GOP lawmaker claims Trump's performance has been even worse than Covid-19 in just 75 days.",
    "Sentiment": -0.4767,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "@edavidds @bennyjohnson Not really, did you see the March jobs report? When someone like China tariffs the U.S. at 67% and Trump tariffs them at 34%, that is more than fair. Look at countries like Vietnam and Korea that have already caved in.",
    "Summary": "A discussion comparing China's 67% tariffs to Trump's 34% is used to argue that the tariff policy is fair, citing examples like Vietnam and Korea.",
    "Sentiment": 0.4902,
    "Cluster": 2,
    "Theme": "trump, tariffs, tariff"
  },
  {
    "Original_Tweet": "@Jabberwocky9791 @GradeyOption1 @SpencerHakimian Lol, Americans will have long thrown Republicans out before any disturbance happens in China as a result of trade war.",
    "Summary": "Some suggest that Americans would oust Republicans well before a trade war with China causes significant disturbances.",
    "Sentiment": -0.5719,
    "Cluster": 3,
    "Theme": "trade, china, trump"
  },
  {
    "Original_Tweet": "\"Ted Cruz warns of midterm ‘bloodbath’ if Trump tariffs cause a recession\" - The Guardian #SmartNews  https://t.co/Z3sy0yz219",
    "Summary": "The Guardian reports Ted Cruz’s stark warning that Trump's tariffs could trigger a recession, leading to a midterm electoral 'bloodbath.'",
    "Sentiment": -0.4939,
    "Cluster": 1,
    "Theme": "trump, trade, tariffs"
  },
  {
    "Original_Tweet": "@NaggerzUnited @dayinthepark @krystalball While I'm extremely skeptical of the maneuvers we're taking in igniting a trade war, you have to understand that people are products of their environment and demagogues often reflect bigger societal issues.",
    "Summary": "Critics argue that trade wars driven by demagogues reveal broader societal problems, with people shaped by their environment.",
    "Sentiment": -0.7574,
    "Cluster": 3,
    "Theme": "trade, china, trump"
  },
  {
    "Original_Tweet": "I want Putian shoes ppl to develop better brand integrity but also, Putian can make any shoes during this trade war. Chinese consumers will be happy since the quality is better than the real ones on top of being cheaper.",
    "Summary": "Amid the trade war, there's hope that Putian shoes can improve brand integrity and deliver better quality at lower prices for Chinese consumers.",
    "Sentiment": 0.7814,
    "Cluster": 3,
    "Theme": "trade, china, trump"
  },
  {
    "Original_Tweet": "These MAGA people sure are showing how uneducated and biased they are, aren’t they? The Trump Tariffs will go down as an overall failure when it’s all said and done.",
    "Summary": "Critics claim that MAGA supporters reveal their uneducated biases, predicting that Trump’s tariffs will ultimately be viewed as a failure.",
    "Sentiment": -0.34,
    "Cluster": 2,
    "Theme": "trump, tariffs, tariff"
  }
]